Autodesk.Revit.DB.Mechanical.DuctPressureDropData
The input and output data used by external servers for calculation of the duct pressure drop.
Remarks:
Profile type, Height, Diameter for round profile or width for other profiles, Length, Density, Viscosity, Roughness and Flow are input field values for the calculation. HydraulicDiameter, ReynoldsNumber, Velocity, VelocityPressure, Friction, PressureDrop, and Coefficient are output field values for the calculation
Since:
2014